app/controllers/api/notebooks_controller.rb

UPDATE "notebooks" SET "name" = $1, "updated_at" = $2 WHERE "notebooks"."id" = $3  [["name", "Demo Notebook"], ["updated_at", "2021-02-11 05:56:15.327475"], ["id", 2]]
---
  def update
    @notebook = Notebook.find_by(id: params[:id])

    if @notebook.update(notebook_params)

INSERT INTO "notebooks" ("name", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Fellowship Members"], ["author_id", 5], ["created_at", "2021-02-11 05:30:47.915584"], ["updated_at", "2021-02-11 05:30:47.915584"]]
---
  def create
    @notebook = Notebook.new(notebook_params)

    if @notebook.save

SELECT "notes"."id" FROM "notes" WHERE "notes"."notebook_id" = $1  [["notebook_id", 43]]
DELETE FROM "notebooks" WHERE "notebooks"."id" = $1  [["id", 3]]
---
  def destroy
    @notebook = current_user.notebooks.find_by(id: params[:id])
    if @notebook && @notebook.destroy