app/controllers/api/notes_controller.rb

  def create
    @note = Note.new(note_params)

    if @note.save
---
INSERT INTO "notes" ("title", "body", "notebook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test note 1"], ["body", "This is a test note"], ["notebook_id", 29], ["created_at", "2021-02-14 19:16:03.649898"], ["updated_at", "2021-02-14 19:16:03.649898"]]

  def destroy
    @note = selected_note
    if @note && @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 2]]