app/controllers/api/notebooks_controller.rb

  def show
    @notebook = selected_notebook
    @notes = @notebook.notes.order(updated_at: :desc)
---
SELECT "notes".* FROM "notes" WHERE "notes"."notebook_id" = $1 ORDER BY "notes"."updated_at" DESC  [["notebook_id", 37]]